package com.example.projectfortune;

public class OtherFortune {
    String El_name[] = {"쥐띠","소띠","호랑이띠","토끼띠","용띠","뱀띠","말띠","양띠","원숭이띠","닭띠","개띠","돼지띠"};
    String El [] ={"주어진 책임이 힘들다 하여 계획을 변경하지 않는 게 좋겠다.  \n" +
            "어려워도 계획대로 진행하는 게 당신보다 주위 사람들을 위해서 더 빛날 수 있다. \n" +
            "숨겨둔 당신의 능력을 보여줄 수 있다면 보여줘라. 오후에 뜻밖의 행운이 찾아올 것이다.","안 좋은 상황이라 생각했는데 극적인 반전을 맛볼 수 있는 날이다. \n" +
            "가급적이면 혼자 있는 시간보다는 주위와 어울리는 시간을 늘리는 것이 유리하다. \n" +
            "여러 사람과 만나는 시간이 많아 질수록, 구하고자 하는 것이 구해질 것이다.","법률적으로 문제가 있던 일이 무사히 해결될 것이다. \n" +
            "자신이 조금 손해 보는 일이 있어도 되도록 참고 양보하는 게 좋다. \n" +
            "생각했던 데로 완성이 되지는 않지만 좋은 성과가 얻을 수 있다. \n" +
            "필요한 씨앗을 얻게 되니 집을 나서면 좋은 사람을 만날 수 있겠다. \n" +
            "좋아하는 이성이 있으면 과감하게 프로포즈 하라.","자신이 원하는 시간에 이룰 수는 없지만 결국 오늘 중으로 원하는 걸 얻을 수 있을 것이다. \n" +
            "집안에 안 좋은 수맥이 있는지 확인해 보는 것도 좋다. 다른 사람 물건을 탐내지 말라. \n" +
            "자신의 것이 아님을 생각하고, 잘못된 미련은 버려야 함이 옳다.\n","신규 사업을 생각하고 있으면, 행동에 들어가기 전에 주위 사람들과 상의하는 게 좋을 것이다. \n" +
            "혼자서 도맡기에는 부담스러운 일들이 벌어질 것이 우려되니, \n" +
            "자문을 구하는 것에 소홀하지 않도록 처신해야 할 것이다. \n" +
            "지나간 고생은 웃어 넘기는 게 좋다.\n","모든 걸 잊고 밖으로 외출하는 것도 의미가 있는 행동이다. \n" +
            "새로운 힘이 용솟음 치는 오후가 기대되는 하루다. \n" +
            "저녁 무렵에 약속이 잡힌다면, 편한 마음으로 만나도록 하라. \n" +
            "뜻밖의 좋은 소식을 들고 온 지인과 만나게 될 수도 있다.","좋은 기회로 인해서 생각지 않던 큰 돈이 들어오니 주체할 수 없는 기쁨과 더불어 작은 고민거리도 생긴다. \n" +
            "이웃과 작은 문제로 인하여 증인으로서의 역할을 할 수도 있다. \n" +
            "큰 것에 만족하고 사소한 일에서 시비거리를 만들지 않는 게 좋겠다. \n" +
            "오늘은 작은 것 보다는 큰 것에 더 큰 행복이 있다.","패기로 무턱대고 일을 진행 하기보다는 자신보다 높은 연배나 선배의 충고를 새겨가면서 진행하는 게 유리하다. \n" +
            "패기와 열정이 넘치는 모습도 좋지만, 그와 더불어 연륜과 지혜로움이 느껴지는 처신이 더 훌륭한 것이다. \n" +
            "늦게 귀인을 만나 해결 될 수 있다.\n","원하는 일이 잘 될 수록 약속을 지키고 신용을 쌓기 위해 노력해야 할 하루다. \n" +
            "지금 베풀어 놓으면 당신이 어려울 때 도움을 받을 수 있다. 이익도 중요하지만 명분도 이에 못지 않다는 걸 알아야 한다. \n" +
            "도움 주는 사람이 많을 것이니 작은 재물이 쌓여 큰 재물이 될 것이다.\n","생각보다 따분하고 단조로울 수 있는 날이다. \n" +
            "그렇다고 무리하게 무언가 새로운 것을 찾으려 하지 말고 관망의 자세를 유지하는 게 유리하다. \n" +
            "섣부른 이동이나 움직임은 금전적 큰 손실을 가져올 수 있으니 조심하는 게 좋다. \n" +
            "되도록 자중하면서 자리를 지키는 게 좋을 것이다.","뜻하지 않은 재물로 기분 좋은 하루가 될 것이다. \n" +
            "하지만, 그 재물을 믿고 행동하면 머지 않아 쉽게 굴러들어온 돈이라 여기고 쉽게 써버릴 수도 있으니 조심하는 게 좋겠다. \n" +
            "단, 대책 없이 빚을 내거나 무리한 약속은 삼가는 게 유리한 하루이다.\n" +
            "\n","어떠한 일에 대한 판단을 해야 할 경우 당신의 결정이 최고의 선택이다. \n" +
            "그대로 밀고 나가면 희망적인 결과를 도출해 낼 것이다. \n" +
            "다만, 재정상황에 따라서 민감하게 행동해야 할 필요성이 감돌고 있으니 긴장을 늦추지 않는 게 좋겠다."};
    String star_name[] = {"물병자리","물고기자리","양자리","황소자리","쌍둥이자리","게자리","사자자리","처녀자리","천칭자리","전갈자리","사수자리","염소자리"};
    String star[]={"아주 좋습니다. 좀 더 용기를 내서 포부를 크게 가져 보십시오. 당신에게 주어진 이 날은 당신이 부딪히고 뛰어다니며 개척한 만큼의 보람과 성과를 안겨 줄 것입니다.",
            "예전의 일이 오늘 일에 영향을 미칩니다. 과거 어느 때 당신이 남모르게 베풀었던 선행이나 공덕이 오늘, 큰 선물이 되어 당신에게 돌아옵니다.",
            "실천해야 하는 날이에요. 상상만 하는 사람이 되지 말고 상상을 현실화하는 사람이 되세요.",
            "여느 날에 비해 보다 긴장이 요구되는 하루가 될 것입니다. 보이지 않게 당신을 위협하는 모종의 함정을 만날 수도 있으니 유념해야 합니다.",
            "그 어느 때보다도 동요되지 않는 침착함이 요구되는군요. 당신의 의지력과 끝까지 최선을 다하는 성실한 노력이 성패의 중요한 열쇠가 될 것입니다.",
            "자신에게 주어진 시간을 잘 활용하여서 알차게 쓰는 것이 중요한 때입니다. 주위의 상황 역시 당신에게 유리한 방향으로 흘러가고 있으니, 활력을 북돋으면서 전진할 수 있을 것입니다.",
            "간만에 정말 살맛이 나는 하루가 될 것입니다. 사실을 말하면 커다란 실수를 한 셈인데 윗사람의 음덕으로 그 실수가 가려지게 됩니다.",
            "누군가로부터 무시를 당할 수 있습니다. 하지만 사람이란 근본적으로 나쁜 사람은 없다고 합니다. 그 사람 자체로는 나쁜 생각을 갖고 태어난 사람이 없다는 뜻이지요.",
            "훈훈한 하루가 되겠군요. 이제까지 보이지 않게 노력한 당신의 수고가 풍성한 결실을 이루어 낼 것입니다.",
            "큰 재난은 없겠지만 썩 좋은 여건 역시 아닙니다. 당신에게 어울리지 않는 자리에 가 있거나 마음이 맞지 않습니다.",
            "큰 별에 오로라가 어우러지는 기운이니 여러 조건이 당신에게 유익한 좋은 시기입니다. 당신의 잠재된 능력이 속속 빛을 발하기 시작합니다. ",
            "출산의 고통 끝에 바라던 아이를 얻게 되는 별의 기운입니다. 다소 고생스럽겠지만 그 이상으로 뿌듯한 기쁨을 맛볼 수 있을 것입니다. "};

    String getEl_name(int i){
        return El_name[i];
    }

    String getStar_name(int i){
        return star_name[i];
    }

    String getEl(int i){
        return El[i];
    }
    String getStar(int i){
        return star[i];
    }




}
